---
kind: other
id: Methods.T:Autodesk.Revit.DB.DividedPath
source: html/2420b7dd-59cb-ea76-1fb4-b00676be3f7f.htm
---
# DividedPath Methods

This checks if the references represent a connected set of curves as required by the divided path.